NordicSemiconductor/nrfx/mdk/nrf54h20_enga_flpr.svd
        <register>
          <name>GPWRDN</name>
          <description>Global Power Down register</description>
          <addressOffset>0x058</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PMUINTSEL</name>
              <description>PMU Interrupt Select (PMUIntSel)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMUACTV</name>
              <description>PMU Active (PMUActv)</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESTORE</name>
              <description>Restore</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRDNCLMP</name>
              <description>Power Down Clamp (PwrDnClmp)</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRDNRSTN</name>
              <description>Power Down ResetN (PwrDnRst_n)</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRDNSWTCH</name>
              <description>Power Down Switch (PwrDnSwtch)</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLEVBUS</name>
              <description>DisableVBUS</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LNSTSCHNG</name>
              <description>Line State Change (LnStsChng)</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINESTAGECHANGEMSK</name>
              <description>LineStageChangeMsk</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESETDETECTED</name>
              <description>ResetDetected</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESETDETMSK</name>
              <description>ResetDetMsk</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCONNECTDETECT</name>
              <description>DisconnectDetect</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCONNECTDETECTMSK</name>
              <description>DisconnectDetectMsk</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONNECTDET</name>
              <description>ConnectDet</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONNDETMSK</name>
              <description>ConnDetMsk</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRPDETECT</name>
              <description>SRPDetect</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRPDETECTMSK</name>
              <description>SRPDetectMsk</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STSCHNGINT</name>
              <description>Status Change Interrupt (StsChngInt)</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STSCHNGINTMSK</name>
              <description>StsChngIntMsk</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOMASK</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINESTATE</name>
              <description>LineState</description>
              <lsb>19</lsb>
              <msb>20</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LS1</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS2</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS3</name>
                  <description>Unspecified</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS4</name>
                  <description>Unspecified</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDDIG</name>
              <description>This bit indicates the status of the signal IDDIG.</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSESSVLD</name>
              <description>B Session Valid (BSessVld)</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTVALID</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULTVALIDBC</name>
              <description>MultValIdBC</description>
              <lsb>24</lsb>
              <msb>28</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RID_0</name>
                  <description>Unspecified</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RID_C</name>
                  <description>Unspecified</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RID_B</name>
                  <description>Unspecified</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RID_A</name>
                  <description>Unspecified</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RID_GND</name>
                  <description>Unspecified</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RID_A_RID_GND</name>
                  <description>Unspecified</description>
                  <value>0x0C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RID_FLOAT</name>
                  <description>Unspecified</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RID_C_RID_FLOAT</name>
                  <description>Unspecified</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RID_B_RID_FLOAT</name>
                  <description>Unspecified</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RID_1</name>
                  <description>Unspecified</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GDFIFOCFG</name>
          <description>Global DFIFO Configuration Register</description>
          <addressOffset>0x05C</addressOffset>
          <access>read-write</access>
          <resetValue>0x0BEA0C00</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>GDFIFOCFG</name>
              <description>GDFIFOCfg</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>EPINFOBASEADDR</name>
              <description>EPInfoBaseAddr</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>GINTMSK2</name>
          <description>Interrupt Mask Register 2</description>
          <addressOffset>0x068</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>GINTMSK2</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>GINTSTS2</name>
          <description>Interrupt Register 2</description>
          <addressOffset>0x06C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>GINTSTS2</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HPTXFSIZ</name>
          <description>Host Periodic Transmit FIFO Size Register</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x04000424</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PTXFSTADDR</name>
              <description>Host Periodic TxFIFO Start Address (PTxFStAddr)</description>
              <lsb>0</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>PTXFSIZE</name>
              <description>Host Periodic TxFIFO Depth (PTxFSize)</description>
              <lsb>16</lsb>
              <msb>26</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTXF1</name>
          <description>Device IN Endpoint Transmit FIFO Size Register 1</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <resetValue>0x02000424</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INEPNTXFSTADDR</name>
              <description>IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr)</description>
              <lsb>0</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>INEPNTXFDEP</name>
              <description>IN Endpoint TxFIFO Depth (INEPnTxFDep)</description>
              <lsb>16</lsb>
              <msb>25</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTXF2</name>
          <description>Device IN Endpoint Transmit FIFO Size Register 2</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <resetValue>0x02000624</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INEPNTXFSTADDR</name>
              <description>IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr)</description>
              <lsb>0</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>INEPNTXFDEP</name>
              <description>IN Endpoint TxFIFO Depth (INEPnTxFDep)</description>
              <lsb>16</lsb>
              <msb>25</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTXF3</name>
          <description>Device IN Endpoint Transmit FIFO Size Register 3</description>
          <addressOffset>0x10C</addressOffset>
          <access>read-write</access>
          <resetValue>0x02000824</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INEPNTXFSTADDR</name>
              <description>IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr)</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>INEPNTXFDEP</name>
              <description>IN Endpoint TxFIFO Depth (INEPnTxFDep)</description>
              <lsb>16</lsb>
              <msb>25</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTXF4</name>
          <description>Device IN Endpoint Transmit FIFO Size Register 4</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
          <resetValue>0x02000A24</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INEPNTXFSTADDR</name>
              <description>IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr)</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>INEPNTXFDEP</name>
              <description>IN Endpoint TxFIFO Depth (INEPnTxFDep)</description>
              <lsb>16</lsb>
              <msb>25</msb>
            </field>
          </fields>
        </register>
