NordicSemiconductor/nrfx/mdk/nrf54h20_enga_flpr.svd
          <register>
            <name>PRESENTSTATEM</name>
            <description>The user can get status of the DWC_mipi_i3c Controller from this 32-bit read only register (Master).</description>
            <addressOffset>0x054</addressOffset>
            <access>read-write</access>
            <resetValue>0x10000003</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SCLLINESIGNALLEVEL</name>
                <description>This bit is used to check the SCL line level to recover from errors and for debugging.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SDALINESIGNALLEVEL</name>
                <description>This bit is used to check the SDA line level to recover from errors and for debugging.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CURRENTMASTER</name>
                <description>This Bit is used to check whether the Master is Current Master or not.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOT_BUS_OWNER</name>
                    <description>Master is not Current Master</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BUS_OWNER</name>
                    <description>Master is Current Master</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CMTFRSTS</name>
                <description>Transfer Type Status</description>
                <lsb>8</lsb>
                <msb>13</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>IDLE</name>
                    <description>Controller is in Idle state, waiting for commands from application or Slave initated In-band Interrupt.</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BCCCWTRANSFER</name>
                    <description>Broadcast CCC Write Transfer.</description>
                    <value>0x01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DCCCWTRANSFER</name>
                    <description>Directed CCC Write Transfer.</description>
                    <value>0x02</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DCCCRTRANSFER</name>
                    <description>Directed CCC Read Transfer.</description>
                    <value>0x03</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENTDAATRANSFER</name>
                    <description>ENTDAA Address Assignment Transfer.</description>
                    <value>0x04</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SETDASATRANSFER</name>
                    <description>SETDASA Address Assignment Transfer.</description>
                    <value>0x05</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SDRWTRANSFER</name>
                    <description>Private I3C SDR Write Transfer.</description>
                    <value>0x06</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SDRRTRANSFER</name>
                    <description>Private I3C SDR Read Transfer.</description>
                    <value>0x07</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SDRWTRANSFERI2C</name>
                    <description>Private I2C SDR Write Transfer.</description>
                    <value>0x08</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SDRRTRANSFERI2C</name>
                    <description>Private I2C SDR Read Transfer.</description>
                    <value>0x09</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TSWTRANSFER</name>
                    <description>Private HDR Ternary Symbol(TS) Write Transfer.</description>
                    <value>0x0A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TSRTRANSFER</name>
                    <description>Private HDR Ternary Symbol(TS) Read Transfer.</description>
                    <value>0x0B</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DDRWTRANSFER</name>
                    <description>Private HDR Double-Data Rate(DDR) Write Transfer.</description>
                    <value>0x0C</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DDRRTRANSFER</name>
                    <description>Private HDR Double-Data Rate(DDR) Read Transfer.</description>
                    <value>0x0D</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IBITRANSFER</name>
                    <description>Servicing In-Band Interrupt Transfer.</description>
                    <value>0x0E</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HALT</name>
                    <description>Halt state. Controller is in Halt State, waiting for the application to resume through DEVICE_CTRL Register.</description>
                    <value>0x0F</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CMTFRSTSTS</name>
                <description>Current Master Transfer State Status.</description>
                <lsb>16</lsb>
                <msb>21</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>IDLE</name>
                    <description>Controller is Idle state, waiting for commands from application or Slave initated In-band Interrupt.</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>START</name>
                    <description>START Generation State.</description>
                    <value>0x01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RESTART</name>
                    <description>RESTART Generation State.</description>
                    <value>0x02</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STOP</name>
                    <description>STOP Genration State.</description>
                    <value>0x03</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STARTH</name>
                    <description>START Hold Generation for the Slave Initiated START State.</description>
                    <value>0x04</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BWADDRGEN</name>
                    <description>Broadcast Write Address Header(7h7E,W) Generation State.</description>
                    <value>0x05</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BRADDRGEN</name>
                    <description>Broadcast Read Address Header(7h7E,R) Generation State.</description>
                    <value>0x06</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DAA</name>
                    <description>Dynamic Address Assignment State.</description>
                    <value>0x07</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADDRGEN</name>
                    <description>Slave Address Generation State.</description>
                    <value>0x08</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CCCBYTEGEN</name>
                    <description>CCC Byte Generation State.</description>
                    <value>0x0B</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HDRCMDGEN</name>
                    <description>HDR Command Generation State.</description>
                    <value>0x0C</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WTRANSFER</name>
                    <description>Write Data Transfer State.</description>
                    <value>0x0D</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RTRANSFER</name>
                    <description>Read Data Transfer State.</description>
                    <value>0x0E</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RIBI</name>
                    <description>In-Band Interrupt(SIR) Read Data State.</description>
                    <value>0x0F</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IBIAUTODISABLE</name>
                    <description>In-Band Interrupt Auto-Disable State</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DDRCRCGEN</name>
                    <description>HDR-DDR CRC Data Generation/Receive State.</description>
                    <value>0x11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CLKEXTEND</name>
                    <description>Clock Extension State.</description>
                    <value>0x12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HALT</name>
                    <description>Halt State.</description>
                    <value>0x13</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CMDTID</name>
                <description>This field reflects the Transaction-ID of the current executing command.</description>
                <lsb>24</lsb>
                <msb>27</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>MASTERIDLE</name>
                <description>This field reflects whether the Master Controller is in Idle state or not.</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MST_NOT_IDLE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MST_IDLE</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PRESENTSTATES</name>
            <description>The user can get status of the DWC_mipi_i3c Controller from this 32-bit read only register (Slave).</description>
            <addressOffset>0x054</addressOffset>
            <access>read-write</access>
            <resetValue>0x10000003</resetValue>
            <alternateRegister>PRESENTSTATEM</alternateRegister>
            <size>0x20</size>
            <fields>
              <field>
                <name>SCLLINESIGNALLEVEL</name>
                <description>This bit is used to check the SCL line level to recover from errors and for debugging.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SDALINESIGNALLEVEL</name>
                <description>This bit is used to check the SDA line level to recover from errors and for debugging.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CURRENTMASTER</name>
                <description>This Bit is used to check whether the Master is Current Master or not.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOT_BUS_OWNER</name>
                    <description>Master is not Current Master</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BUS_OWNER</name>
                    <description>Master is Current Master</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CMTFRSTS</name>
                <description>Transfer Type Status</description>
                <lsb>8</lsb>
                <msb>13</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SLAVEIDLE</name>
                    <description>Controller is in Idle state.</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SLAVEHOTJOIN</name>
                    <description>Hot-Join transfer state.</description>
                    <value>0x01</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SLAVEIBITRANSFER</name>
                    <description>IBI transfer state.</description>
                    <value>0x02</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SLAVEWTRANSFER</name>
                    <description>Master write transfer ongoing.</description>
                    <value>0x03</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SLAVERPREFETCH</name>
                    <description>Read data prefetch state.</description>
                    <value>0x04</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SLAVERTRANSFER</name>
                    <description>Master read transfer ongoing.</description>
                    <value>0x05</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SLAVEHALT</name>
                    <description>Slave controller in Halt State waiting for resume from application.</description>
                    <value>0x06</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CMTFRSTSTS</name>
                <description>Current Master Transfer State Status.</description>
                <lsb>16</lsb>
                <msb>21</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CMDTID</name>
                <description>This field reflects the Transaction-ID of the current executing command.</description>
                <lsb>24</lsb>
                <msb>27</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>MASTERIDLE</name>
                <description>This field reflects whether the Master Controller is in Idle state or not.</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MST_NOT_IDLE</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MST_IDLE</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CCCDEVICESTATUS</name>
            <description>Device Operating Status Register.</description>
            <addressOffset>0x058</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PENDINGINTR</name>
                <description>Pending Interrupt</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PROTOCOLERR</name>
                <description>Protocol Error</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ACTIVITYMODE</name>
                <description>Activity Mode</description>
                <lsb>6</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>UNDERFLOWERR</name>
                <description>Underflow error</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>SLAVEBUSY</name>
                <description>Slave Busy</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>OVERFLOWERR</name>
                <description>Overflow Error</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DATANOTREADY</name>
                <description>Data not ready</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>BUFFERNOTAVAIL</name>
                <description>Buffer not available</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>FRAMEERROR</name>
                <description>Frame Error</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DEVICEADDRTABLEPOINTER</name>
            <description>Pointer for Device Address Table</description>
            <addressOffset>0x05C</addressOffset>
            <access>read-write</access>
            <resetValue>0x000A02C0</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PDEVADDRTABLESTARTADDR</name>
                <description>Start Address of Device Address Table.</description>
                <lsb>0</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DEVADDRTABLEDEPTH</name>
                <description>Depth of Device Address Table</description>
                <lsb>16</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DEVCHARTABLEPOINTER</name>
            <description>Pointer for Device Characteristics Table</description>
            <addressOffset>0x060</addressOffset>
            <access>read-write</access>
            <resetValue>0x00028200</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PDEVCHARTABLESTARTADDR</name>
                <description>Start Address of Device Characteristics Table.</description>
                <lsb>0</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DEVCHARTABLEDEPTH</name>
                <description>Depth of Device Characteristics Table</description>
                <lsb>12</lsb>
                <msb>18</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PRESENTDEVCHARTABLEINDX</name>
                <description>Current index of Device Characteristics Table.</description>
                <lsb>19</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>VENDORSPECIFICREGPOINTER</name>
            <description>Pointer for Vendor Specific Registers.</description>
            <addressOffset>0x06C</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000B0</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PVENDORREGSTARTADDR</name>
                <description>Start Address of Vendor specific registers.</description>
                <lsb>0</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SLVMIPIIDVALUE</name>
            <description>I3C MIPI Manufacturer ID Register.</description>
            <addressOffset>0x070</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SLVPROVIDSEL</name>
                <description>Specifies the Provisional ID Type Selector (PID[32]).</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>SLVMIPIMFGID</name>
                <description>Specifies the MIPI Manufacturer ID.</description>
                <lsb>1</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
