NordicSemiconductor/nrfx/mdk/nrf54h20_enga_flpr.svd
        <register>
          <name>ENABLE</name>
          <description>PDM module enable register</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable or disable PDM module</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PDMCLKCTRL</name>
          <description>PDM clock generator control</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <resetValue>0x08400000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FREQ</name>
              <description>PDM_CLK frequency configuration. Enumerations are deprecated, use
        PDMCLKCTRL equation to find the register value. The 12 least significant bits of the
        register are ignored and shall be set to zero.</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1000K</name>
                  <description>PDM_CLK = 32 MHz / 32 = 1.000 MHz</description>
                  <value>0x08000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Default</name>
                  <description>PDM_CLK = 32 MHz / 31 = 1.032 MHz. Nominal clock for RATIO=Ratio64.</description>
                  <value>0x08400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1067K</name>
                  <description>PDM_CLK = 32 MHz / 30 = 1.067 MHz</description>
                  <value>0x08800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1231K</name>
                  <description>PDM_CLK = 32 MHz / 26 = 1.231 MHz</description>
                  <value>0x09800000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1280K</name>
                  <description>PDM_CLK = 32 MHz / 25 = 1.280 MHz. Nominal clock for RATIO=Ratio80.</description>
                  <value>0x0A000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1333K</name>
                  <description>PDM_CLK = 32 MHz / 24 = 1.333 MHz</description>
                  <value>0x0A800000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Defines the routing of the connected PDM microphones' signals</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OPERATION</name>
              <description>Mono or stereo operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Stereo</name>
                  <description>Sample and store one pair (left + right) of 16-bit samples per RAM word R=[31:16]; L=[15:0]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Mono</name>
                  <description>Sample and store two successive left samples (16 bits each) per RAM word L1=[31:16]; L0=[15:0]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGE</name>
              <description>Defines on which PDM_CLK edge left (or mono) is sampled</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LeftFalling</name>
                  <description>Left (or mono) is sampled on falling edge of PDM_CLK</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LeftRising</name>
                  <description>Left (or mono) is sampled on rising edge of PDM_CLK</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GAINL</name>
          <description>Left output gain adjustment</description>
          <addressOffset>0x518</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000028</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>GAINL</name>
              <description>Left output gain adjustment, in 0.5 dB steps, around the default module gain (see electrical parameters) 0x00    -20 dB gain adjust 0x01  -19.5 dB gain adjust (...) 0x27   -0.5 dB gain adjust 0x28      0 dB gain adjust 0x29   +0.5 dB gain adjust (...) 0x4F  +19.5 dB gain adjust 0x50    +20 dB gain adjust</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MinGain</name>
                  <description>-20 dB gain adjustment (minimum)</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DefaultGain</name>
                  <description>0 dB gain adjustment</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MaxGain</name>
                  <description>+20 dB gain adjustment (maximum)</description>
                  <value>0x50</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GAINR</name>
          <description>Right output gain adjustment</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000028</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>GAINR</name>
              <description>Right output gain adjustment, in 0.5 dB steps, around the default module gain (see electrical parameters)</description>
              <lsb>0</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MinGain</name>
                  <description>-20 dB gain adjustment (minimum)</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DefaultGain</name>
                  <description>0 dB gain adjustment</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MaxGain</name>
                  <description>+20 dB gain adjustment (maximum)</description>
                  <value>0x50</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RATIO</name>
          <description>Selects the ratio between PDM_CLK and output sample rate. Change PDMCLKCTRL accordingly.</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RATIO</name>
              <description>Selects the ratio between PDM_CLK and output sample rate</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ratio64</name>
                  <description>Ratio of 64</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ratio80</name>
                  <description>Ratio of 80</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PSEL</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_PDM_PSEL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x540</addressOffset>
          <register>
            <name>CLK</name>
            <description>Pin number configuration for PDM CLK signal</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DIN</name>
            <description>Pin number configuration for PDM DIN signal</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>MCLKCONFIG</name>
          <description>Master clock generator configuration</description>
          <addressOffset>0x54C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SRC</name>
              <description>Master clock source selection</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCLK32M</name>
                  <description>32 MHz peripheral clock</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK</name>
                  <description>Audio PLL clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>SAMPLE</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_PDM_SAMPLE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x560</addressOffset>
          <register>
            <name>PTR</name>
            <description>RAM address pointer to write samples to with EasyDMA</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SAMPLEPTR</name>
                <description>Address to write PDM samples to over DMA</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Number of samples to allocate memory for in EasyDMA mode</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BUFFSIZE</name>
                <description>Length of DMA RAM allocation in number of samples</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>DMA</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_PDM_DMA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x700</addressOffset>
          <register>
            <name>TERMINATEONBUSERROR</name>
            <description>Terminate the transaction if a BUSERROR event is detected.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BUSERRORADDRESS</name>
            <description>Address of transaction that generated the last BUSERROR event.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDRESS</name>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
