NordicSemiconductor/nrfx/mdk/nrf54h20_enga_flpr.svd
        <cluster>
          <name>PSEL</name>
          <description>Unspecified</description>
          <headerStructName>TWIM_PSEL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x508</addressOffset>
          <register>
            <name>SCL</name>
            <description>Pin select for SCL signal</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SDA</name>
            <description>Pin select for SDA signal</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>FREQUENCY</name>
          <description>TWI frequency. Accuracy depends on the HFCLK source selected.</description>
          <addressOffset>0x524</addressOffset>
          <access>read-write</access>
          <resetValue>0x04000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FREQUENCY</name>
              <description>TWI master clock frequency</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>K100</name>
                  <description>100 kbps</description>
                  <value>0x01980000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K250</name>
                  <description>250 kbps</description>
                  <value>0x04000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K400</name>
                  <description>400 kbps</description>
                  <value>0x06400000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K1000</name>
                  <description>1000 kbps</description>
                  <value>0x0FF00000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>RXD</name>
          <description>RXD EasyDMA channel</description>
          <headerStructName>TWIM_RXD</headerStructName>
          <access>read-write</access>
          <addressOffset>0x534</addressOffset>
          <register>
            <name>PTR</name>
            <description>Data pointer</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Maximum number of bytes in receive buffer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of bytes in receive buffer</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Number of bytes transferred in the last transaction</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LIST</name>
            <description>EasyDMA list type</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LIST</name>
                <description>List type</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable EasyDMA list</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ArrayList</name>
                    <description>Use array list</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TXD</name>
          <description>TXD EasyDMA channel</description>
          <headerStructName>TWIM_TXD</headerStructName>
          <access>read-write</access>
          <addressOffset>0x544</addressOffset>
          <register>
            <name>PTR</name>
            <description>Data pointer</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PTR</name>
                <description>Data pointer</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Maximum number of bytes in transmit buffer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of bytes in transmit buffer</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Number of bytes transferred in the last transaction</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte.</description>
                <lsb>0</lsb>
                <msb>14</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LIST</name>
            <description>EasyDMA list type</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LIST</name>
                <description>List type</description>
                <lsb>0</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable EasyDMA list</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ArrayList</name>
                    <description>Use array list</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>ADDRESS</name>
          <description>Address used in the TWI transfer</description>
          <addressOffset>0x588</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>Address used in the TWI transfer</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>DMA</name>
          <description>Unspecified</description>
          <headerStructName>TWIM_DMA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x5B0</addressOffset>
          <cluster>
            <name>RX</name>
            <description>Unspecified</description>
            <headerStructName>TWIM_DMA_RX</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>TERMINATEONBUSERROR</name>
              <description>Terminate the transaction if a BUSERROR event is detected.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ENABLE</name>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>BUSERRORADDRESS</name>
              <description>Address of transaction that generated the last BUSERROR event.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ADDRESS</name>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>TX</name>
            <description>Unspecified</description>
            <headerStructName>TWIM_DMA_TX</headerStructName>
            <access>read-write</access>
            <addressOffset>0x008</addressOffset>
            <register>
              <name>TERMINATEONBUSERROR</name>
              <description>Terminate the transaction if a BUSERROR event is detected.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ENABLE</name>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>BUSERRORADDRESS</name>
              <description>Address of transaction that generated the last BUSERROR event.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ADDRESS</name>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
