NordicSemiconductor/nrfx/mdk/nrf54h20_enga_flpr.svd
        <register>
          <name>CONFIG</name>
          <description>Configuration register for the address match mechanism</description>
          <addressOffset>0x594</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADDRESS0</name>
              <description>Enable or disable address matching on ADDRESS[0]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDRESS1</name>
              <description>Enable or disable address matching on ADDRESS[1]</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>DMA</name>
          <description>Unspecified</description>
          <headerStructName>TWIS_DMA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x5B0</addressOffset>
          <cluster>
            <name>RX</name>
            <description>Unspecified</description>
            <headerStructName>TWIS_DMA_RX</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>TERMINATEONBUSERROR</name>
              <description>Terminate the transaction if a BUSERROR event is detected.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ENABLE</name>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>BUSERRORADDRESS</name>
              <description>Address of transaction that generated the last BUSERROR event.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ADDRESS</name>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>TX</name>
            <description>Unspecified</description>
            <headerStructName>TWIS_DMA_TX</headerStructName>
            <access>read-write</access>
            <addressOffset>0x008</addressOffset>
            <register>
              <name>TERMINATEONBUSERROR</name>
              <description>Terminate the transaction if a BUSERROR event is detected.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ENABLE</name>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>BUSERRORADDRESS</name>
              <description>Address of transaction that generated the last BUSERROR event.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ADDRESS</name>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <register>
          <name>ORC</name>
          <description>Over-read character. Character sent out in case of an over-read of the transmit buffer.</description>
          <addressOffset>0x5C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ORC</name>
              <description>Over-read character. Character sent out in case of an over-read of the transmit buffer.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
